# FormatOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FormatOptions Methods
FormatOptions Class See Also
---
The FormatOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanHaveSymbol()()()() | Checks whether a symbol can be specified to display the unit in this FormatOptions. |
| CanHaveSymbol(ForgeTypeId) | Checks whether a symbol can be specified to display a given unit. |
| CanSuppressLeadingZeros()()()() | Checks whether leading zeros can be suppressed for the display unit in this FormatOptions. |
| CanSuppressLeadingZeros(ForgeTypeId) | Checks whether leading zeros can be suppressed for a given unit. |
| CanSuppressSpaces()()()() | Checks whether spaces can be suppressed for the display unit in this FormatOptions. |
| CanSuppressSpaces(ForgeTypeId) | Checks whether spaces can be suppressed for a given unit. |
| CanSuppressTrailingZeros()()()() | Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions. |
| CanSuppressTrailingZeros(ForgeTypeId) | Checks whether trailing zeros can be suppressed for a given unit. |
| CanUsePlusPrefix()()()() | Checks whether a plus prefix can be displayed for the display unit in this FormatOptions. |
| CanUsePlusPrefix(ForgeTypeId) | Checks whether a plus prefix can be displayed for a given unit. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSymbolTypeId | Gets the identifier of the symbol indicating the unit quantifying the value. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetUnitTypeId | Gets the identifier of the unit used to quantify values. |
| GetValidSymbols()()()() | Gets the identifiers of all valid symbols for the unit in this FormatOptions. |
| GetValidSymbols(ForgeTypeId) | Gets the identifiers of all valid symbols for a given unit. |
| IsValidAccuracy(Double) | Checks whether an accuracy is valid for the display unit in this FormatOptions. |
| IsValidAccuracy(ForgeTypeId, Double) | Checks whether an accuracy is valid for a given unit. |
| IsValidForSpec | Checks whether this FormatOptions is valid for a given spec. |
| IsValidSymbol(ForgeTypeId) | Checks whether a symbol is valid for the unit in this FormatOptions. |
| IsValidSymbol(ForgeTypeId, ForgeTypeId) | Checks whether a symbol is valid for a given unit. |
| SetSymbolTypeId | Sets the symbol that should be displayed to indicate the unit quantifying the value. |
| SetUnitTypeId | Sets the unit used to quantify values. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FormatOptions Class
Autodesk.Revit.DB Namespace